############################################# 数 Number ################################################
############ 数字运算 #############
# + - * /

# 1. 基本类型
# 整型int、浮点型float
# C/C++/Java
# int a = 1;
# float b = 1.1;
# double c = 1.2;

#使用type函数，查看对象类型
a = -1
b = 1.1

print(type(1))
print(type(1.1))
print(type(a))
print(type(b))

# <class 'int'>
# 所有皆是对象
a = a.__abs__()
print(a)

# 不同类型混合计算
print(type(1+1.0))

# / 除法  //整除
print(type(2/2))
print(type(2//2))

#################### 进制 #############################
# 10进制、2进制、8进制、16进制
# 10进制计数：0,1,2,3,4,5,6,7,8,9,10
# 2进制计数：0,1,10
# 8进制计数：0,1,2,3,4,5,6,7,10
# 16进制计数：0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F,10
# 其他进制计数：60秒 = 1分钟

# 10进制
10
# 2进制
0b10
# 8进制
0o10
# 16进制
0x10
# 转换2进制
bin(11)
# 转换10进制
int(0xFF)
# 转换8进制
oct(12)
# 转换16进制
hex(15)



######################################### 布尔类型 ######################################
True
False

print(type(True))
print(type(False))
# True 是 1，False 是 0
print(int(True))
print(int(False))
# 非0是True，0是False，非空是True，空是False
print(bool(-1.01))
print(bool(0))
print((bool('123')))
print(bool(''))
print(bool(None))



############################# 复数 ################################
# 使用j表示复数
print(36j)

# 说明：复数在软件开发中基本不用，在学习时，要学会抓大放小，不经常使用的知识点，可以只会检索，不用记住。